royal-mail-shipping-api/dan/soap-current-attempt-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.royalmailgroup.com/integration/core/V1" xmlns:ns2="http://www.royalmailgroup.com/api/ship/V2" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:UsernameToken wsu:Id="UsernameToken-000">
            <wsse:Username>martin@audiovisualonline.co.ukAPI</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">5sevjwQtzX3h5cT7xEXHL3gjD6Y=</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">Mzc2NDY2Mw==</wsse:Nonce>
            <wsu:Created>2016-04-25T15:38:33z</wsu:Created>
        </wsse:UsernameToken>
    </wsse:Security>
</SOAP-ENV:Header><SOAP-ENV:Body><ns2:request1DRangesRequest><ns2:integrationHeader><ns1:dateTime>2016-04-25T15:38:33z</ns1:dateTime><ns1:version>2</ns1:version><ns1:identification><ns1:applicationId>0127229000</ns1:applicationId><ns1:transactionId>1</ns1:transactionId></ns1:identification></ns2:integrationHeader><ns2:serviceReferences><ns2:serviceReference><ns2:serviceOffering><serviceOfferingCode><code>SD1</code></serviceOfferingCode></ns2:serviceOffering><ns2:serviceType><code>D</code></ns2:serviceType></ns2:serviceReference></ns2:serviceReferences></ns2:request1DRangesRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
